#### Terraform Plan (dev) 📖`failure`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_policy_document.assume_eks-worker_role: Reading...
aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole-20231022205450612700000001]
aws_iam_role.AmazonEKS_EBS_CSI_DriverRole: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole]
data.aws_iam_policy_document.assume_eks_role: Reading...
aws_eks_addon.aws-ebs-csi-driver: Refreshing state... [id=dev-conquer-cluster:aws-ebs-csi-driver]
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
aws_iam_role.eks_worker_role: Refreshing state... [id=dev-conquer-eks-worker-role]
aws_iam_role.eks_role: Refreshing state... [id=dev-conquer-eks-role]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-conquer-eks-worker-role-20231022173339124900000002]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-conquer-eks-worker-role-20231022173339080800000001]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-conquer-eks-worker-role-20231022173339325300000004]
aws_iam_role_policy_attachment.AmazonEC2RoleforSSM: Refreshing state... [id=dev-conquer-eks-worker-role-20231022173339470100000005]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-conquer-eks-role-20231022173339280300000003]
aws_eks_cluster.eks: Refreshing state... [id=dev-conquer-cluster]
aws_eks_addon.example: Refreshing state... [id=dev-conquer-cluster:vpc-cni]
aws_eks_node_group.node-group["subnet-0355ff3c88d14c102"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-1]
aws_eks_node_group.node-group["subnet-085e59a0866b87184"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-0]
helm_release.argocd: Refreshing state... [id=argocd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_default_route_table.vpc_default_rt will be created
  + resource "aws_default_route_table" "vpc_default_rt" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags                   = {
          + "Name" = "dev-conquer-vpc-default-rt"
        }
      + tags_all               = {
          + "Name"    = "dev-conquer-vpc-default-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_eip.vpc_eip["eu-north-1a"] will be created
  + resource "aws_eip" "vpc_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "dev-conquer-eip-eu-north-1a"
        }
      + tags_all             = {
          + "Name"    = "dev-conquer-eip-eu-north-1a"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.vpc_eip["eu-north-1b"] will be created
  + resource "aws_eip" "vpc_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "dev-conquer-eip-eu-north-1b"
        }
      + tags_all             = {
          + "Name"    = "dev-conquer-eip-eu-north-1b"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.vpc_eip["eu-north-1c"] will be created
  + resource "aws_eip" "vpc_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "dev-conquer-eip-eu-north-1c"
        }
      + tags_all             = {
          + "Name"    = "dev-conquer-eip-eu-north-1c"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc                  = (known after apply)
    }

  # aws_eks_addon.aws-ebs-csi-driver will be destroyed
  # (because aws_eks_addon.aws-ebs-csi-driver is not in configuration)
  - resource "aws_eks_addon" "aws-ebs-csi-driver" {
      - addon_name                  = "aws-ebs-csi-driver" -> null
      - addon_version               = "v1.24.0-eksbuild.1" -> null
      - arn                         = "arn:aws:eks:eu-north-1:014630368052:addon/dev-conquer-cluster/aws-ebs-csi-driver/a0c5ac99-7a5a-a5fb-c453-aa8726a91aca" -> null
      - cluster_name                = "dev-conquer-cluster" -> null
      - created_at                  = "2023-10-22T21:03:13Z" -> null
      - id                          = "dev-conquer-cluster:aws-ebs-csi-driver" -> null
      - modified_at                 = "2023-10-22T21:13:17Z" -> null
      - resolve_conflicts_on_update = "PRESERVE" -> null
      - service_account_role_arn    = "arn:aws:iam::014630368052:role/AmazonEKS_EBS_CSI_DriverRole" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
    }

  # aws_eks_cluster.eks must be replaced
-/+ resource "aws_eks_cluster" "eks" {
      ~ arn                       = "arn:aws:eks:eu-north-1:014630368052:cluster/dev-conquer-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJTTNpSGJPai9JQmd3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpFd01qSXhOek15TkRCYUZ3MHpNekV3TVRreE56TTNOREJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURTaS9LSWx1TnJIT2xxMkFnWjJEd2FmSW8wbTNBUmNsdGM1K21DVm9hT0pLRnB0YXRxVGxUL3EzakEKeU1kTyt2ZXRQTlhhYTE0Tk95a1VOcXM3UHF2K1RwVlZKKzgvam9aNEJjSHAvZWtSbXVMZHhXVHBnRDg2R2ZlcgoxV28vTUJGb1BLNjkvMjlWSUNKREhGRUZHblZFbG1QOG1PVktkNXJyNU9LdUR4Q2ZZVUFWd0kzbkQyZzU5RU81CjdYTE1TQUF6L0dYV1c5U0FicWprSkVZNldjMkN3T1RKS0pxeXJRMEFYbFhsRklYUkVvTVZmS3dUazR1WmpXVTQKU1QxNXI4NWJza1U2NWRPTUcrN0w2WSt3NjBQSWx5Mk1oQU9pTm96cWxQaWtjWWZUZHJic3NjOGRhWTFnNVE5MgpSVE03aUZNUDluNlg1MnNsWFE0RTg4Z0ZDb3cvQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRaWgrVms3YUlrRVZzMksxQ0ZQbWk0MWg1QXZ6QVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQzRPWFVjaVpKUQpZeVA2d2ZPLzNqRmZOSGpHbkFRZkZaUTdIUUVjdHRZN3loYlFCYzJCdndia1p0Ky9pV2FrbEVEeWNUcFRDK0tjCnhtSFFoaGhOWVh2M01HY1FzK0NoRWE5WWxXWCtzREZWdkFMbWk3YlJBNHFmUXJDcWJ1SVN5Vnc1NlV6c3ZaU3AKY3NNdEljSkR0bmhrMzgyWGlXWjdCWmhxVFhZbGZpdzhSQzc5YUhyN0FpV2N5dm5tT01INEFlV2t4NmRIUzZFeApnQnk3N0IzVW5aN3YvdnNrV1kwZnlMOGp0QzlKcElHVzZ1djFXSDlEU1lCSXF2WTB3eFNlWWRDRHlzWGtjeFFMCmlTeGhxZmFlTTZaUjh5SEN1N3ZLOXpUT0lBK2ZPRUhzRGl5MWg3aWwvWFhxN0ZLZTVMZk1BeWF2cWJtRGdNNzEKLzE1Z1oxV3F1TVlOCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2023-10-22 17:33:42.466 +0000 UTC" -> (known after apply)
      ~ endpoint                  = "https://6EEDEB7080842B84B8DB70660B5A4B41.gr7.eu-north-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "dev-conquer-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.eu-north-1.amazonaws.com/id/6EEDEB7080842B84B8DB70660B5A4B41"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "dev-conquer-cluster"
      ~ platform_version          = "eks.6" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "ctf" = "WW91IGdvdCBpdCEgbmljZS4="
        }
        # (4 unchanged attributes hidden)

      ~ kubernetes_network_config {
          + service_ipv6_cidr = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0bf6402afa552954a" -> (known after apply)
          - security_group_ids        = [] -> null
          ~ subnet_ids                = [ # forces replacement
              - "subnet-0355ff3c88d14c102",
              - "subnet-085e59a0866b87184",
            ] -> (known after apply) # forces replacement
          ~ vpc_id                    = "vpc-0e724d4c7ed376ef9" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_eks_node_group.node-group["eu-north-1a"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "dev-conquer-node-group-0"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_eks_node_group.node-group["eu-north-1b"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "dev-conquer-node-group-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_eks_node_group.node-group["eu-north-1c"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "dev-conquer-node-group-2"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_eks_node_group.node-group["subnet-0355ff3c88d14c102"] will be destroyed
  # (because key ["subnet-0355ff3c88d14c102"] is not in for_each map)
  - resource "aws_eks_node_group" "node-group" {
      - ami_type        = "AL2_x86_64" -> null
      - arn             = "arn:aws:eks:eu-north-1:014630368052:nodegroup/dev-conquer-cluster/dev-conquer-node-group-1/b4c5ac3d-0591-8f21-e34e-7a9e71dd1422" -> null
      - capacity_type   = "SPOT" -> null
      - cluster_name    = "dev-conquer-cluster" -> null
      - disk_size       = 20 -> null
      - id              = "dev-conquer-cluster:dev-conquer-node-group-1" -> null
      - instance_types  = [
          - "t3.small",
        ] -> null
      - labels          = {} -> null
      - node_group_name = "dev-conquer-node-group-1" -> null
      - node_role_arn   = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role" -> null
      - release_version = "1.27.5-20231002" -> null
      - resources       = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-conquer-node-group-1-b4c5ac3d-0591-8f21-e34e-7a9e71dd1422"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status          = "ACTIVE" -> null
      - subnet_ids      = [
          - "subnet-0355ff3c88d14c102",
        ] -> null
      - tags            = {} -> null
      - tags_all        = {
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - version         = "1.27" -> null

      - scaling_config {
          - desired_size = 3 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # aws_eks_node_group.node-group["subnet-085e59a0866b87184"] will be destroyed
  # (because key ["subnet-085e59a0866b87184"] is not in for_each map)
  - resource "aws_eks_node_group" "node-group" {
      - ami_type        = "AL2_x86_64" -> null
      - arn             = "arn:aws:eks:eu-north-1:014630368052:nodegroup/dev-conquer-cluster/dev-conquer-node-group-0/96c5ac3d-057e-fe1b-4f4c-8ceb185b8cbe" -> null
      - capacity_type   = "SPOT" -> null
      - cluster_name    = "dev-conquer-cluster" -> null
      - disk_size       = 20 -> null
      - id              = "dev-conquer-cluster:dev-conquer-node-group-0" -> null
      - instance_types  = [
          - "t3.small",
        ] -> null
      - labels          = {} -> null
      - node_group_name = "dev-conquer-node-group-0" -> null
      - node_role_arn   = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role" -> null
      - release_version = "1.27.5-20231002" -> null
      - resources       = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-conquer-node-group-0-96c5ac3d-057e-fe1b-4f4c-8ceb185b8cbe"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status          = "ACTIVE" -> null
      - subnet_ids      = [
          - "subnet-085e59a0866b87184",
        ] -> null
      - tags            = {} -> null
      - tags_all        = {
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - version         = "1.27" -> null

      - scaling_config {
          - desired_size = 3 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # aws_iam_role.AmazonEKS_EBS_CSI_DriverRole will be destroyed
  # (because aws_iam_role.AmazonEKS_EBS_CSI_DriverRole is not in configuration)
  - resource "aws_iam_role" "AmazonEKS_EBS_CSI_DriverRole" {
      - arn                   = "arn:aws:iam::014630368052:role/AmazonEKS_EBS_CSI_DriverRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "oidc.eks.eu-north-1.amazonaws.com/id/6EEDEB7080842B84B8DB70660B5A4B41:aud" = "sts.amazonaws.com"
                              - "oidc.eks.eu-north-1.amazonaws.com/id/6EEDEB7080842B84B8DB70660B5A4B41:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/6EEDEB7080842B84B8DB70660B5A4B41"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-10-22T20:54:49Z" -> null
      - force_detach_policies = false -> null
      - id                    = "AmazonEKS_EBS_CSI_DriverRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "AmazonEKS_EBS_CSI_DriverRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - unique_id             = "AROAQG2AJWM2DSMBYQLN2" -> null
    }

  # aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonEBSCSIDriverPolicy-attachment" {
      - id         = "AmazonEKS_EBS_CSI_DriverRole-20231022205450612700000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy" -> null
      - role       = "AmazonEKS_EBS_CSI_DriverRole" -> null
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "dev-conquer-vpc-igw"
        }
      + tags_all = {
          + "Name"    = "dev-conquer-vpc-igw"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat_gw["eu-north-1a"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1a"
        }
      + tags_all                           = {
          + "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1a"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_nat_gateway.nat_gw["eu-north-1b"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1b"
        }
      + tags_all                           = {
          + "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1b"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_nat_gateway.nat_gw["eu-north-1c"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1c"
        }
      + tags_all                           = {
          + "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1c"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_route.nat_access["eu-north-1a"] will be created
  + resource "aws_route" "nat_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat_access["eu-north-1b"] will be created
  + resource "aws_route" "nat_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat_access["eu-north-1c"] will be created
  + resource "aws_route" "nat_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_subnet_rt["eu-north-1a"] will be created
  + resource "aws_route_table" "private_subnet_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-conquer-nat-eu-north-1a-rt"
        }
      + tags_all         = {
          + "Name"    = "dev-conquer-nat-eu-north-1a-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private_subnet_rt["eu-north-1b"] will be created
  + resource "aws_route_table" "private_subnet_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-conquer-nat-eu-north-1b-rt"
        }
      + tags_all         = {
          + "Name"    = "dev-conquer-nat-eu-north-1b-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private_subnet_rt["eu-north-1c"] will be created
  + resource "aws_route_table" "private_subnet_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-conquer-nat-eu-north-1c-rt"
        }
      + tags_all         = {
          + "Name"    = "dev-conquer-nat-eu-north-1c-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1a"] will be created
  + resource "aws_route_table_association" "private_subnet_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1b"] will be created
  + resource "aws_route_table_association" "private_subnet_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1c"] will be created
  + resource "aws_route_table_association" "private_subnet_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.eks_subnets_private["eu-north-1a"] will be created
  + resource "aws_subnet" "eks_subnets_private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-private_subnet_eu-north-1a"
          + "Tier" = "Private"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-private_subnet_eu-north-1a"
          + "Tier"    = "Private"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_subnets_private["eu-north-1b"] will be created
  + resource "aws_subnet" "eks_subnets_private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-private_subnet_eu-north-1b"
          + "Tier" = "Private"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-private_subnet_eu-north-1b"
          + "Tier"    = "Private"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_subnets_private["eu-north-1c"] will be created
  + resource "aws_subnet" "eks_subnets_private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-private_subnet_eu-north-1c"
          + "Tier" = "Private"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-private_subnet_eu-north-1c"
          + "Tier"    = "Private"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_subnets_public["eu-north-1a"] will be created
  + resource "aws_subnet" "eks_subnets_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-public_subnet_eu-north-1a"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-public_subnet_eu-north-1a"
          + "Tier"    = "Public"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_subnets_public["eu-north-1b"] will be created
  + resource "aws_subnet" "eks_subnets_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-public_subnet_eu-north-1b"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-public_subnet_eu-north-1b"
          + "Tier"    = "Public"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_subnets_public["eu-north-1c"] will be created
  + resource "aws_subnet" "eks_subnets_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-public_subnet_eu-north-1c"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-public_subnet_eu-north-1c"
          + "Tier"    = "Public"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.conquer-vpc will be created
  + resource "aws_vpc" "conquer-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "dev-conquer-vpc"
        }
      + tags_all                             = {
          + "Name"    = "dev-conquer-vpc"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

Plan: 28 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  ~ endpoint                              = "https://6EEDEB7080842B84B8DB70660B5A4B41.gr7.eu-north-1.eks.amazonaws.com" -> (known after apply)
  ~ kubeconfig-certificate-authority-data = (sensitive value)
  ~ oidc-issuer                           = [
      - {
          - oidc = [
              - {
                  - issuer = "https://oidc.eks.eu-north-1.amazonaws.com/id/6EEDEB7080842B84B8DB70660B5A4B41"
                },
            ]
        },
    ] -> (known after apply)

```

</details>

*Pusher: @carlosgit2016, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*